garyPenhook/PIC-Assembler/device_includes/pic16f17526.inc
// Register: OPA1CON2
#define OPA1CON2 OPA1CON2
OPA1CON2                                 equ 090Eh
// bitfield definitions
OPA1CON2_PCH_POSN                        equ 0000h
OPA1CON2_PCH_POSITION                    equ 0000h
OPA1CON2_PCH_SIZE                        equ 0004h
OPA1CON2_PCH_LENGTH                      equ 0004h
OPA1CON2_PCH_MASK                        equ 000Fh
OPA1CON2_FMS_POSN                        equ 0006h
OPA1CON2_FMS_POSITION                    equ 0006h
OPA1CON2_FMS_SIZE                        equ 0002h
OPA1CON2_FMS_LENGTH                      equ 0002h
OPA1CON2_FMS_MASK                        equ 00C0h
OPA1CON2_PCH0_POSN                       equ 0000h
OPA1CON2_PCH0_POSITION                   equ 0000h
OPA1CON2_PCH0_SIZE                       equ 0001h
OPA1CON2_PCH0_LENGTH                     equ 0001h
OPA1CON2_PCH0_MASK                       equ 0001h
OPA1CON2_PCH1_POSN                       equ 0001h
OPA1CON2_PCH1_POSITION                   equ 0001h
OPA1CON2_PCH1_SIZE                       equ 0001h
OPA1CON2_PCH1_LENGTH                     equ 0001h
OPA1CON2_PCH1_MASK                       equ 0002h
OPA1CON2_PCH2_POSN                       equ 0002h
OPA1CON2_PCH2_POSITION                   equ 0002h
OPA1CON2_PCH2_SIZE                       equ 0001h
OPA1CON2_PCH2_LENGTH                     equ 0001h
OPA1CON2_PCH2_MASK                       equ 0004h
OPA1CON2_PCH3_POSN                       equ 0003h
OPA1CON2_PCH3_POSITION                   equ 0003h
OPA1CON2_PCH3_SIZE                       equ 0001h
OPA1CON2_PCH3_LENGTH                     equ 0001h
OPA1CON2_PCH3_MASK                       equ 0008h
OPA1CON2_FMS0_POSN                       equ 0006h
OPA1CON2_FMS0_POSITION                   equ 0006h
OPA1CON2_FMS0_SIZE                       equ 0001h
OPA1CON2_FMS0_LENGTH                     equ 0001h
OPA1CON2_FMS0_MASK                       equ 0040h
OPA1CON2_FMS1_POSN                       equ 0007h
OPA1CON2_FMS1_POSITION                   equ 0007h
OPA1CON2_FMS1_SIZE                       equ 0001h
OPA1CON2_FMS1_LENGTH                     equ 0001h
OPA1CON2_FMS1_MASK                       equ 0080h
OPA1CON2_OPA1PCH_POSN                    equ 0000h
OPA1CON2_OPA1PCH_POSITION                equ 0000h
OPA1CON2_OPA1PCH_SIZE                    equ 0004h
OPA1CON2_OPA1PCH_LENGTH                  equ 0004h
OPA1CON2_OPA1PCH_MASK                    equ 000Fh
OPA1CON2_OPA1FMS_POSN                    equ 0006h
OPA1CON2_OPA1FMS_POSITION                equ 0006h
OPA1CON2_OPA1FMS_SIZE                    equ 0002h
OPA1CON2_OPA1FMS_LENGTH                  equ 0002h
OPA1CON2_OPA1FMS_MASK                    equ 00C0h
OPA1CON2_OPA1PCH0_POSN                   equ 0000h
OPA1CON2_OPA1PCH0_POSITION               equ 0000h
OPA1CON2_OPA1PCH0_SIZE                   equ 0001h
OPA1CON2_OPA1PCH0_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH0_MASK                   equ 0001h
OPA1CON2_OPA1PCH1_POSN                   equ 0001h
OPA1CON2_OPA1PCH1_POSITION               equ 0001h
OPA1CON2_OPA1PCH1_SIZE                   equ 0001h
OPA1CON2_OPA1PCH1_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH1_MASK                   equ 0002h
OPA1CON2_OPA1PCH2_POSN                   equ 0002h
OPA1CON2_OPA1PCH2_POSITION               equ 0002h
OPA1CON2_OPA1PCH2_SIZE                   equ 0001h
OPA1CON2_OPA1PCH2_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH2_MASK                   equ 0004h
OPA1CON2_OPA1PCH3_POSN                   equ 0003h
OPA1CON2_OPA1PCH3_POSITION               equ 0003h
OPA1CON2_OPA1PCH3_SIZE                   equ 0001h
OPA1CON2_OPA1PCH3_LENGTH                 equ 0001h
OPA1CON2_OPA1PCH3_MASK                   equ 0008h
OPA1CON2_OPA1FMS0_POSN                   equ 0006h
OPA1CON2_OPA1FMS0_POSITION               equ 0006h
OPA1CON2_OPA1FMS0_SIZE                   equ 0001h
OPA1CON2_OPA1FMS0_LENGTH                 equ 0001h
OPA1CON2_OPA1FMS0_MASK                   equ 0040h
OPA1CON2_OPA1FMS1_POSN                   equ 0007h
OPA1CON2_OPA1FMS1_POSITION               equ 0007h
OPA1CON2_OPA1FMS1_SIZE                   equ 0001h
OPA1CON2_OPA1FMS1_LENGTH                 equ 0001h
OPA1CON2_OPA1FMS1_MASK                   equ 0080h

// Register: OPA1CON3
#define OPA1CON3 OPA1CON3
OPA1CON3                                 equ 090Fh
// bitfield definitions
OPA1CON3_NCH_POSN                        equ 0000h
OPA1CON3_NCH_POSITION                    equ 0000h
OPA1CON3_NCH_SIZE                        equ 0005h
OPA1CON3_NCH_LENGTH                      equ 0005h
OPA1CON3_NCH_MASK                        equ 001Fh
OPA1CON3_NCH0_POSN                       equ 0000h
OPA1CON3_NCH0_POSITION                   equ 0000h
OPA1CON3_NCH0_SIZE                       equ 0001h
OPA1CON3_NCH0_LENGTH                     equ 0001h
OPA1CON3_NCH0_MASK                       equ 0001h
OPA1CON3_NCH1_POSN                       equ 0001h
OPA1CON3_NCH1_POSITION                   equ 0001h
OPA1CON3_NCH1_SIZE                       equ 0001h
OPA1CON3_NCH1_LENGTH                     equ 0001h
OPA1CON3_NCH1_MASK                       equ 0002h
OPA1CON3_NCH2_POSN                       equ 0002h
OPA1CON3_NCH2_POSITION                   equ 0002h
OPA1CON3_NCH2_SIZE                       equ 0001h
OPA1CON3_NCH2_LENGTH                     equ 0001h
OPA1CON3_NCH2_MASK                       equ 0004h
OPA1CON3_NCH3_POSN                       equ 0003h
OPA1CON3_NCH3_POSITION                   equ 0003h
OPA1CON3_NCH3_SIZE                       equ 0001h
OPA1CON3_NCH3_LENGTH                     equ 0001h
OPA1CON3_NCH3_MASK                       equ 0008h
OPA1CON3_OPA1NCH_POSN                    equ 0000h
OPA1CON3_OPA1NCH_POSITION                equ 0000h
OPA1CON3_OPA1NCH_SIZE                    equ 0005h
OPA1CON3_OPA1NCH_LENGTH                  equ 0005h
OPA1CON3_OPA1NCH_MASK                    equ 001Fh
OPA1CON3_OPA1NCH0_POSN                   equ 0000h
OPA1CON3_OPA1NCH0_POSITION               equ 0000h
OPA1CON3_OPA1NCH0_SIZE                   equ 0001h
OPA1CON3_OPA1NCH0_LENGTH                 equ 0001h
OPA1CON3_OPA1NCH0_MASK                   equ 0001h
OPA1CON3_OPA1NCH1_POSN                   equ 0001h
OPA1CON3_OPA1NCH1_POSITION               equ 0001h
OPA1CON3_OPA1NCH1_SIZE                   equ 0001h
OPA1CON3_OPA1NCH1_LENGTH                 equ 0001h
OPA1CON3_OPA1NCH1_MASK                   equ 0002h
OPA1CON3_OPA1NCH2_POSN                   equ 0002h
OPA1CON3_OPA1NCH2_POSITION               equ 0002h
OPA1CON3_OPA1NCH2_SIZE                   equ 0001h
OPA1CON3_OPA1NCH2_LENGTH                 equ 0001h
OPA1CON3_OPA1NCH2_MASK                   equ 0004h
OPA1CON3_OPA1NCH3_POSN                   equ 0003h
OPA1CON3_OPA1NCH3_POSITION               equ 0003h
OPA1CON3_OPA1NCH3_SIZE                   equ 0001h
OPA1CON3_OPA1NCH3_LENGTH                 equ 0001h
OPA1CON3_OPA1NCH3_MASK                   equ 0008h

// Register: OPA1OFFSET
#define OPA1OFFSET OPA1OFFSET
OPA1OFFSET                               equ 0910h
// bitfield definitions
OPA1OFFSET_OFFSET_POSN                   equ 0000h
OPA1OFFSET_OFFSET_POSITION               equ 0000h
OPA1OFFSET_OFFSET_SIZE                   equ 0008h
OPA1OFFSET_OFFSET_LENGTH                 equ 0008h
OPA1OFFSET_OFFSET_MASK                   equ 00FFh
OPA1OFFSET_OFFSET0_POSN                  equ 0000h
OPA1OFFSET_OFFSET0_POSITION              equ 0000h
OPA1OFFSET_OFFSET0_SIZE                  equ 0001h
OPA1OFFSET_OFFSET0_LENGTH                equ 0001h
OPA1OFFSET_OFFSET0_MASK                  equ 0001h
OPA1OFFSET_OFFSET1_POSN                  equ 0001h
OPA1OFFSET_OFFSET1_POSITION              equ 0001h
OPA1OFFSET_OFFSET1_SIZE                  equ 0001h
OPA1OFFSET_OFFSET1_LENGTH                equ 0001h
OPA1OFFSET_OFFSET1_MASK                  equ 0002h
OPA1OFFSET_OFFSET2_POSN                  equ 0002h
OPA1OFFSET_OFFSET2_POSITION              equ 0002h
OPA1OFFSET_OFFSET2_SIZE                  equ 0001h
OPA1OFFSET_OFFSET2_LENGTH                equ 0001h
OPA1OFFSET_OFFSET2_MASK                  equ 0004h
OPA1OFFSET_OFFSET3_POSN                  equ 0003h
OPA1OFFSET_OFFSET3_POSITION              equ 0003h
OPA1OFFSET_OFFSET3_SIZE                  equ 0001h
OPA1OFFSET_OFFSET3_LENGTH                equ 0001h
OPA1OFFSET_OFFSET3_MASK                  equ 0008h
OPA1OFFSET_OFFSET4_POSN                  equ 0004h
OPA1OFFSET_OFFSET4_POSITION              equ 0004h
OPA1OFFSET_OFFSET4_SIZE                  equ 0001h
OPA1OFFSET_OFFSET4_LENGTH                equ 0001h
OPA1OFFSET_OFFSET4_MASK                  equ 0010h
OPA1OFFSET_OFFSET5_POSN                  equ 0005h
OPA1OFFSET_OFFSET5_POSITION              equ 0005h
OPA1OFFSET_OFFSET5_SIZE                  equ 0001h
OPA1OFFSET_OFFSET5_LENGTH                equ 0001h
OPA1OFFSET_OFFSET5_MASK                  equ 0020h
OPA1OFFSET_OFFSET6_POSN                  equ 0006h
OPA1OFFSET_OFFSET6_POSITION              equ 0006h
OPA1OFFSET_OFFSET6_SIZE                  equ 0001h
OPA1OFFSET_OFFSET6_LENGTH                equ 0001h
OPA1OFFSET_OFFSET6_MASK                  equ 0040h
OPA1OFFSET_OFFSET7_POSN                  equ 0007h
OPA1OFFSET_OFFSET7_POSITION              equ 0007h
OPA1OFFSET_OFFSET7_SIZE                  equ 0001h
OPA1OFFSET_OFFSET7_LENGTH                equ 0001h
OPA1OFFSET_OFFSET7_MASK                  equ 0080h
OPA1OFFSET_OPA1OFFSET_POSN               equ 0000h
OPA1OFFSET_OPA1OFFSET_POSITION           equ 0000h
OPA1OFFSET_OPA1OFFSET_SIZE               equ 0008h
OPA1OFFSET_OPA1OFFSET_LENGTH             equ 0008h
OPA1OFFSET_OPA1OFFSET_MASK               equ 00FFh
OPA1OFFSET_OPA1OFFSET0_POSN              equ 0000h
OPA1OFFSET_OPA1OFFSET0_POSITION          equ 0000h
OPA1OFFSET_OPA1OFFSET0_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET0_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET0_MASK              equ 0001h
OPA1OFFSET_OPA1OFFSET1_POSN              equ 0001h
OPA1OFFSET_OPA1OFFSET1_POSITION          equ 0001h
OPA1OFFSET_OPA1OFFSET1_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET1_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET1_MASK              equ 0002h
OPA1OFFSET_OPA1OFFSET2_POSN              equ 0002h
OPA1OFFSET_OPA1OFFSET2_POSITION          equ 0002h
OPA1OFFSET_OPA1OFFSET2_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET2_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET2_MASK              equ 0004h
OPA1OFFSET_OPA1OFFSET3_POSN              equ 0003h
OPA1OFFSET_OPA1OFFSET3_POSITION          equ 0003h
OPA1OFFSET_OPA1OFFSET3_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET3_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET3_MASK              equ 0008h
OPA1OFFSET_OPA1OFFSET4_POSN              equ 0004h
OPA1OFFSET_OPA1OFFSET4_POSITION          equ 0004h
OPA1OFFSET_OPA1OFFSET4_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET4_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET4_MASK              equ 0010h
OPA1OFFSET_OPA1OFFSET5_POSN              equ 0005h
OPA1OFFSET_OPA1OFFSET5_POSITION          equ 0005h
OPA1OFFSET_OPA1OFFSET5_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET5_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET5_MASK              equ 0020h
OPA1OFFSET_OPA1OFFSET6_POSN              equ 0006h
OPA1OFFSET_OPA1OFFSET6_POSITION          equ 0006h
OPA1OFFSET_OPA1OFFSET6_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET6_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET6_MASK              equ 0040h
OPA1OFFSET_OPA1OFFSET7_POSN              equ 0007h
OPA1OFFSET_OPA1OFFSET7_POSITION          equ 0007h
OPA1OFFSET_OPA1OFFSET7_SIZE              equ 0001h
OPA1OFFSET_OPA1OFFSET7_LENGTH            equ 0001h
OPA1OFFSET_OPA1OFFSET7_MASK              equ 0080h

// Register: OPA1CON4
#define OPA1CON4 OPA1CON4
OPA1CON4                                 equ 0911h
// bitfield definitions
OPA1CON4_OFCSEL_POSN                     equ 0000h
OPA1CON4_OFCSEL_POSITION                 equ 0000h
OPA1CON4_OFCSEL_SIZE                     equ 0002h
OPA1CON4_OFCSEL_LENGTH                   equ 0002h
OPA1CON4_OFCSEL_MASK                     equ 0003h
OPA1CON4_OFCST_POSN                      equ 0002h
OPA1CON4_OFCST_POSITION                  equ 0002h
OPA1CON4_OFCST_SIZE                      equ 0001h
OPA1CON4_OFCST_LENGTH                    equ 0001h
OPA1CON4_OFCST_MASK                      equ 0004h
OPA1CON4_OFCSEL0_POSN                    equ 0000h
OPA1CON4_OFCSEL0_POSITION                equ 0000h
OPA1CON4_OFCSEL0_SIZE                    equ 0001h
OPA1CON4_OFCSEL0_LENGTH                  equ 0001h
OPA1CON4_OFCSEL0_MASK                    equ 0001h
OPA1CON4_OFCSEL1_POSN                    equ 0001h
OPA1CON4_OFCSEL1_POSITION                equ 0001h
OPA1CON4_OFCSEL1_SIZE                    equ 0001h
OPA1CON4_OFCSEL1_LENGTH                  equ 0001h
OPA1CON4_OFCSEL1_MASK                    equ 0002h
OPA1CON4_OPA1OFCSEL_POSN                 equ 0000h
OPA1CON4_OPA1OFCSEL_POSITION             equ 0000h
OPA1CON4_OPA1OFCSEL_SIZE                 equ 0002h
OPA1CON4_OPA1OFCSEL_LENGTH               equ 0002h
OPA1CON4_OPA1OFCSEL_MASK                 equ 0003h
OPA1CON4_OPA1OFCST_POSN                  equ 0002h
OPA1CON4_OPA1OFCST_POSITION              equ 0002h
OPA1CON4_OPA1OFCST_SIZE                  equ 0001h
OPA1CON4_OPA1OFCST_LENGTH                equ 0001h
OPA1CON4_OPA1OFCST_MASK                  equ 0004h
OPA1CON4_OPA1OFCSEL0_POSN                equ 0000h
OPA1CON4_OPA1OFCSEL0_POSITION            equ 0000h
OPA1CON4_OPA1OFCSEL0_SIZE                equ 0001h
OPA1CON4_OPA1OFCSEL0_LENGTH              equ 0001h
OPA1CON4_OPA1OFCSEL0_MASK                equ 0001h
OPA1CON4_OPA1OFCSEL1_POSN                equ 0001h
OPA1CON4_OPA1OFCSEL1_POSITION            equ 0001h
OPA1CON4_OPA1OFCSEL1_SIZE                equ 0001h
OPA1CON4_OPA1OFCSEL1_LENGTH              equ 0001h
OPA1CON4_OPA1OFCSEL1_MASK                equ 0002h

// Register: NVMADRL
#define NVMADRL NVMADRL
NVMADRL                                  equ 01C8Ch
// bitfield definitions
NVMADRL_NVMADR_POSN                      equ 0000h
NVMADRL_NVMADR_POSITION                  equ 0000h
NVMADRL_NVMADR_SIZE                      equ 0008h
NVMADRL_NVMADR_LENGTH                    equ 0008h
NVMADRL_NVMADR_MASK                      equ 00FFh
NVMADRL_NVMADR0_POSN                     equ 0000h
NVMADRL_NVMADR0_POSITION                 equ 0000h
NVMADRL_NVMADR0_SIZE                     equ 0001h
NVMADRL_NVMADR0_LENGTH                   equ 0001h
NVMADRL_NVMADR0_MASK                     equ 0001h
NVMADRL_NVMADR1_POSN                     equ 0001h
NVMADRL_NVMADR1_POSITION                 equ 0001h
NVMADRL_NVMADR1_SIZE                     equ 0001h
NVMADRL_NVMADR1_LENGTH                   equ 0001h
NVMADRL_NVMADR1_MASK                     equ 0002h
NVMADRL_NVMADR2_POSN                     equ 0002h
NVMADRL_NVMADR2_POSITION                 equ 0002h
NVMADRL_NVMADR2_SIZE                     equ 0001h
NVMADRL_NVMADR2_LENGTH                   equ 0001h
NVMADRL_NVMADR2_MASK                     equ 0004h
NVMADRL_NVMADR3_POSN                     equ 0003h
NVMADRL_NVMADR3_POSITION                 equ 0003h
NVMADRL_NVMADR3_SIZE                     equ 0001h
NVMADRL_NVMADR3_LENGTH                   equ 0001h
NVMADRL_NVMADR3_MASK                     equ 0008h
NVMADRL_NVMADR4_POSN                     equ 0004h
NVMADRL_NVMADR4_POSITION                 equ 0004h
NVMADRL_NVMADR4_SIZE                     equ 0001h
NVMADRL_NVMADR4_LENGTH                   equ 0001h
NVMADRL_NVMADR4_MASK                     equ 0010h
NVMADRL_NVMADR5_POSN                     equ 0005h
NVMADRL_NVMADR5_POSITION                 equ 0005h
NVMADRL_NVMADR5_SIZE                     equ 0001h
NVMADRL_NVMADR5_LENGTH                   equ 0001h
NVMADRL_NVMADR5_MASK                     equ 0020h
NVMADRL_NVMADR6_POSN                     equ 0006h
NVMADRL_NVMADR6_POSITION                 equ 0006h
NVMADRL_NVMADR6_SIZE                     equ 0001h
NVMADRL_NVMADR6_LENGTH                   equ 0001h
NVMADRL_NVMADR6_MASK                     equ 0040h
NVMADRL_NVMADR7_POSN                     equ 0007h
NVMADRL_NVMADR7_POSITION                 equ 0007h
NVMADRL_NVMADR7_SIZE                     equ 0001h
NVMADRL_NVMADR7_LENGTH                   equ 0001h
NVMADRL_NVMADR7_MASK                     equ 0080h

