garyPenhook/PIC-Assembler/device_includes/pic16f17526.inc
// Register: ADERRL
#define ADERRL ADERRL
ADERRL                                   equ 01D10h
// bitfield definitions
ADERRL_ERR_POSN                          equ 0000h
ADERRL_ERR_POSITION                      equ 0000h
ADERRL_ERR_SIZE                          equ 0008h
ADERRL_ERR_LENGTH                        equ 0008h
ADERRL_ERR_MASK                          equ 00FFh
ADERRL_ADERR0_POSN                       equ 0000h
ADERRL_ADERR0_POSITION                   equ 0000h
ADERRL_ADERR0_SIZE                       equ 0001h
ADERRL_ADERR0_LENGTH                     equ 0001h
ADERRL_ADERR0_MASK                       equ 0001h
ADERRL_ADERR1_POSN                       equ 0001h
ADERRL_ADERR1_POSITION                   equ 0001h
ADERRL_ADERR1_SIZE                       equ 0001h
ADERRL_ADERR1_LENGTH                     equ 0001h
ADERRL_ADERR1_MASK                       equ 0002h
ADERRL_ADERR2_POSN                       equ 0002h
ADERRL_ADERR2_POSITION                   equ 0002h
ADERRL_ADERR2_SIZE                       equ 0001h
ADERRL_ADERR2_LENGTH                     equ 0001h
ADERRL_ADERR2_MASK                       equ 0004h
ADERRL_ADERR3_POSN                       equ 0003h
ADERRL_ADERR3_POSITION                   equ 0003h
ADERRL_ADERR3_SIZE                       equ 0001h
ADERRL_ADERR3_LENGTH                     equ 0001h
ADERRL_ADERR3_MASK                       equ 0008h
ADERRL_ADERR4_POSN                       equ 0004h
ADERRL_ADERR4_POSITION                   equ 0004h
ADERRL_ADERR4_SIZE                       equ 0001h
ADERRL_ADERR4_LENGTH                     equ 0001h
ADERRL_ADERR4_MASK                       equ 0010h
ADERRL_ADERR5_POSN                       equ 0005h
ADERRL_ADERR5_POSITION                   equ 0005h
ADERRL_ADERR5_SIZE                       equ 0001h
ADERRL_ADERR5_LENGTH                     equ 0001h
ADERRL_ADERR5_MASK                       equ 0020h
ADERRL_ADERR6_POSN                       equ 0006h
ADERRL_ADERR6_POSITION                   equ 0006h
ADERRL_ADERR6_SIZE                       equ 0001h
ADERRL_ADERR6_LENGTH                     equ 0001h
ADERRL_ADERR6_MASK                       equ 0040h
ADERRL_ADERR7_POSN                       equ 0007h
ADERRL_ADERR7_POSITION                   equ 0007h
ADERRL_ADERR7_SIZE                       equ 0001h
ADERRL_ADERR7_LENGTH                     equ 0001h
ADERRL_ADERR7_MASK                       equ 0080h
ADERRL_ADERR_POSN                        equ 0000h
ADERRL_ADERR_POSITION                    equ 0000h
ADERRL_ADERR_SIZE                        equ 0008h
ADERRL_ADERR_LENGTH                      equ 0008h
ADERRL_ADERR_MASK                        equ 00FFh
ADERRL_ERR0_POSN                         equ 0000h
ADERRL_ERR0_POSITION                     equ 0000h
ADERRL_ERR0_SIZE                         equ 0001h
ADERRL_ERR0_LENGTH                       equ 0001h
ADERRL_ERR0_MASK                         equ 0001h
ADERRL_ERR1_POSN                         equ 0001h
ADERRL_ERR1_POSITION                     equ 0001h
ADERRL_ERR1_SIZE                         equ 0001h
ADERRL_ERR1_LENGTH                       equ 0001h
ADERRL_ERR1_MASK                         equ 0002h
ADERRL_ERR2_POSN                         equ 0002h
ADERRL_ERR2_POSITION                     equ 0002h
ADERRL_ERR2_SIZE                         equ 0001h
ADERRL_ERR2_LENGTH                       equ 0001h
ADERRL_ERR2_MASK                         equ 0004h
ADERRL_ERR3_POSN                         equ 0003h
ADERRL_ERR3_POSITION                     equ 0003h
ADERRL_ERR3_SIZE                         equ 0001h
ADERRL_ERR3_LENGTH                       equ 0001h
ADERRL_ERR3_MASK                         equ 0008h
ADERRL_ERR4_POSN                         equ 0004h
ADERRL_ERR4_POSITION                     equ 0004h
ADERRL_ERR4_SIZE                         equ 0001h
ADERRL_ERR4_LENGTH                       equ 0001h
ADERRL_ERR4_MASK                         equ 0010h
ADERRL_ERR5_POSN                         equ 0005h
ADERRL_ERR5_POSITION                     equ 0005h
ADERRL_ERR5_SIZE                         equ 0001h
ADERRL_ERR5_LENGTH                       equ 0001h
ADERRL_ERR5_MASK                         equ 0020h
ADERRL_ERR6_POSN                         equ 0006h
ADERRL_ERR6_POSITION                     equ 0006h
ADERRL_ERR6_SIZE                         equ 0001h
ADERRL_ERR6_LENGTH                       equ 0001h
ADERRL_ERR6_MASK                         equ 0040h
ADERRL_ERR7_POSN                         equ 0007h
ADERRL_ERR7_POSITION                     equ 0007h
ADERRL_ERR7_SIZE                         equ 0001h
ADERRL_ERR7_LENGTH                       equ 0001h
ADERRL_ERR7_MASK                         equ 0080h

// Register: ADERRH
#define ADERRH ADERRH
ADERRH                                   equ 01D11h
// bitfield definitions
ADERRH_ERR_POSN                          equ 0000h
ADERRH_ERR_POSITION                      equ 0000h
ADERRH_ERR_SIZE                          equ 0008h
ADERRH_ERR_LENGTH                        equ 0008h
ADERRH_ERR_MASK                          equ 00FFh
ADERRH_ADERR8_POSN                       equ 0000h
ADERRH_ADERR8_POSITION                   equ 0000h
ADERRH_ADERR8_SIZE                       equ 0001h
ADERRH_ADERR8_LENGTH                     equ 0001h
ADERRH_ADERR8_MASK                       equ 0001h
ADERRH_ADERR9_POSN                       equ 0001h
ADERRH_ADERR9_POSITION                   equ 0001h
ADERRH_ADERR9_SIZE                       equ 0001h
ADERRH_ADERR9_LENGTH                     equ 0001h
ADERRH_ADERR9_MASK                       equ 0002h
ADERRH_ADERR10_POSN                      equ 0002h
ADERRH_ADERR10_POSITION                  equ 0002h
ADERRH_ADERR10_SIZE                      equ 0001h
ADERRH_ADERR10_LENGTH                    equ 0001h
ADERRH_ADERR10_MASK                      equ 0004h
ADERRH_ADERR11_POSN                      equ 0003h
ADERRH_ADERR11_POSITION                  equ 0003h
ADERRH_ADERR11_SIZE                      equ 0001h
ADERRH_ADERR11_LENGTH                    equ 0001h
ADERRH_ADERR11_MASK                      equ 0008h
ADERRH_ADERR12_POSN                      equ 0004h
ADERRH_ADERR12_POSITION                  equ 0004h
ADERRH_ADERR12_SIZE                      equ 0001h
ADERRH_ADERR12_LENGTH                    equ 0001h
ADERRH_ADERR12_MASK                      equ 0010h
ADERRH_ADERR13_POSN                      equ 0005h
ADERRH_ADERR13_POSITION                  equ 0005h
ADERRH_ADERR13_SIZE                      equ 0001h
ADERRH_ADERR13_LENGTH                    equ 0001h
ADERRH_ADERR13_MASK                      equ 0020h
ADERRH_ADERR14_POSN                      equ 0006h
ADERRH_ADERR14_POSITION                  equ 0006h
ADERRH_ADERR14_SIZE                      equ 0001h
ADERRH_ADERR14_LENGTH                    equ 0001h
ADERRH_ADERR14_MASK                      equ 0040h
ADERRH_ADERR15_POSN                      equ 0007h
ADERRH_ADERR15_POSITION                  equ 0007h
ADERRH_ADERR15_SIZE                      equ 0001h
ADERRH_ADERR15_LENGTH                    equ 0001h
ADERRH_ADERR15_MASK                      equ 0080h
ADERRH_ADERR_POSN                        equ 0000h
ADERRH_ADERR_POSITION                    equ 0000h
ADERRH_ADERR_SIZE                        equ 0008h
ADERRH_ADERR_LENGTH                      equ 0008h
ADERRH_ADERR_MASK                        equ 00FFh
ADERRH_ERR8_POSN                         equ 0000h
ADERRH_ERR8_POSITION                     equ 0000h
ADERRH_ERR8_SIZE                         equ 0001h
ADERRH_ERR8_LENGTH                       equ 0001h
ADERRH_ERR8_MASK                         equ 0001h
ADERRH_ERR9_POSN                         equ 0001h
ADERRH_ERR9_POSITION                     equ 0001h
ADERRH_ERR9_SIZE                         equ 0001h
ADERRH_ERR9_LENGTH                       equ 0001h
ADERRH_ERR9_MASK                         equ 0002h
ADERRH_ERR10_POSN                        equ 0002h
ADERRH_ERR10_POSITION                    equ 0002h
ADERRH_ERR10_SIZE                        equ 0001h
ADERRH_ERR10_LENGTH                      equ 0001h
ADERRH_ERR10_MASK                        equ 0004h
ADERRH_ERR11_POSN                        equ 0003h
ADERRH_ERR11_POSITION                    equ 0003h
ADERRH_ERR11_SIZE                        equ 0001h
ADERRH_ERR11_LENGTH                      equ 0001h
ADERRH_ERR11_MASK                        equ 0008h
ADERRH_ERR12_POSN                        equ 0004h
ADERRH_ERR12_POSITION                    equ 0004h
ADERRH_ERR12_SIZE                        equ 0001h
ADERRH_ERR12_LENGTH                      equ 0001h
ADERRH_ERR12_MASK                        equ 0010h
ADERRH_ERR13_POSN                        equ 0005h
ADERRH_ERR13_POSITION                    equ 0005h
ADERRH_ERR13_SIZE                        equ 0001h
ADERRH_ERR13_LENGTH                      equ 0001h
ADERRH_ERR13_MASK                        equ 0020h
ADERRH_ERR14_POSN                        equ 0006h
ADERRH_ERR14_POSITION                    equ 0006h
ADERRH_ERR14_SIZE                        equ 0001h
ADERRH_ERR14_LENGTH                      equ 0001h
ADERRH_ERR14_MASK                        equ 0040h
ADERRH_ERR15_POSN                        equ 0007h
ADERRH_ERR15_POSITION                    equ 0007h
ADERRH_ERR15_SIZE                        equ 0001h
ADERRH_ERR15_LENGTH                      equ 0001h
ADERRH_ERR15_MASK                        equ 0080h

